posts/2022/12/02/jupyter-in-the-cloud.org
# -*- org-attach-id-dir: "../../../../files/attachments"; -*-
#+nikola-metadata: /home/sd80/programming/simoninireland.github.io/posts/2022/12/02/jupyter-in-the-cloud.meta

* Notes on using Jupyter in the cloud                                :ATTACH:
  :PROPERTIES:
  :ID:       3de9ecd3-991b-49e9-8419-a22be50c6b21
  :END:

  I've been thinking about running [[https://jupyter.org][Jupyter notebooks]] in the cloud for
  some fairly compute-intensive simulation. Specifically I want to do
  epidemic and other simulations over complex networks. These are
  CPU-intensive and don't make use of GPU acceleration (yet, anyway).
  Using the cloud would make things easier to scale-out, especially
  for those without access to a local compute cluster.

  {{{TEASER_END}}}

  I decided to do some experiments by writing [[link:../../../../attachments/3d/e9ecd3-991b-49e9-8419-a22be50c6b21/epydemicbasics.ipynb][a small Jupyter notebook]]
  that would exercise a cloud service by running some simulations
  using [[https://github.com/simoninireland/epydemic][epydemic]], our network process simulation framework. The idea
  was to see how performant the cloud services on offer are, starting
  with [[https://colab.research.google.com/][Google Colab]] as the most accessible.

** Reference execution

   As a reference, I first ran a small experiment with an SIR
   epidemic on an ER network of $10^4$ nodes, $\langle k \rangle =
   10$. The first experiment runs 10 repetitions sequentially on a
   single core; the second runs 10 repetitions for every core we run
   on. [[https://github.com/simoninireland/epyc][epyc]], our process management library, schedules worker
   processes in individual processes which can then be scheduled
   independently by the operating system, and which don't therefore
   run into synchronisation problems due to the Python Global
   Interpreter Lock.

   Running this on my desktop machine (Intel Core i7@3.8GHz) on 8
   cores and taking averages gives:

   | Cores | Elapsed time (s) | Mean/rep (s) | Variance |
   |-------+------------------+--------------+----------|
   |     1 |               38 |         3.86 |     0.06 |
   |     8 |               43 |         4.27 |     0.09 |

   There's some overhead from the collection of the experimental
   results from the worker processes.

** Running epydemic on a default runtime

   I then tried the same experiments on the default Colab set-up.

   The notebook can import libraries no problem. It can also create
   HDF5 notebooks, meaning it has the underlying libraries installed
   already. The GUI reports 12GB of RAM and 100GB of disc
   (approximately).

   We run on all the available cores, as reported by the
   ~epyc.ParallelLab.numberOfCores()~ method. Running the same
   experiments as above gives:

   | vCPUs | Elapsed time (s) | Mean/rep (s) | Variance |
   |-------+------------------+--------------+----------|
   |     1 |               81 |         8.17 |     0.90 |
   |     2 |              100 |        10.87 |     0.34 |

   which is a little unusual: there's definitely some overlapped
   computation happening, but with large overheads and large variance.
   I'm assuming that the number of /cores/ reported is actually the
   number of /hyperthreads/, and that they're interfering because
   they're CPU-bound: ~epyc~ simply uses the standard Python ~joblib~.
   Or it might be that the underlying VM isn't really allocating cores
   exclusively. There's really not enough information to decide.

