2022/12/02/jupyter-in-the-cloud/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Notes on using Jupyter in the cloud | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		    <li><a href="../../../../rss.xml">RSS</a></li>
	    </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Friday 2 December, 2022</a>
	    </span>
	</div>
	<h1>Notes on using Jupyter in the cloud</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgd922b0d" class="outline-2">
<h2 id="orgd922b0d">Notes on using Jupyter in the cloud</h2>
<div class="outline-text-2" id="text-orgd922b0d">
<p>
I've been thinking about running <a href="https://jupyter.org">Jupyter notebooks</a> in the cloud for
some fairly compute-intensive simulation. Specifically I want to do
epidemic and other simulations over complex networks. These are
CPU-intensive and don't make use of GPU acceleration (yet, anyway).
Using the cloud would make things easier to scale-out, especially
for those without access to a local compute cluster.
</p>

<!-- TEASER_END -->

<p>
I decided to do some experiments by writing <a href="../../../../attachments/3d/e9ecd3-991b-49e9-8419-a22be50c6b21/epydemicbasics.ipynb">a small Jupyter notebook</a>
that would exercise a cloud service by running some simulations
using <a href="https://github.com/simoninireland/epydemic">epydemic</a>, our network process simulation framework. The idea
was to see how performant the cloud services on offer are, starting
with <a href="https://colab.research.google.com/">Google Colab</a> as the most accessible.
</p>
</div>

<div id="outline-container-org31a6a9b" class="outline-3">
<h3 id="org31a6a9b">Reference execution</h3>
<div class="outline-text-3" id="text-org31a6a9b">
<p>
As a reference, I firsat ran a small experiment with an SIR
epidemic on an ER network of \(10^4\) nodes, \(\langle k \rangle =
   10\). The first experiment runs 10 repetitions sequentially on a
single core; the second runs 10 repetitions for every core we run
on. <a href="https://github.com/simoninireland/epyc">epyc</a>, our process management library, schedules worker
processes in individual processes which can then be scheduled
independently by the operating system, and which don't therefore
run into synchronisation problems due to the Python Global
Interpreter Lock.
</p>

<p>
Running this on my desktop machine (Intel Core i7@3.8GHz) on 8
cores and taking averages gives:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-right">Cores</th>
<th scope="col" class="org-right">Elapsed time (s)</th>
<th scope="col" class="org-right">Mean/rep (s)</th>
<th scope="col" class="org-right">Variance</th>
</tr></thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">38</td>
<td class="org-right">3.86</td>
<td class="org-right">0.06</td>
</tr>
<tr>
<td class="org-right">8</td>
<td class="org-right">43</td>
<td class="org-right">4.27</td>
<td class="org-right">0.09</td>
</tr>
</tbody>
</table>
<p>
There's some overhead from the collection of the experimental
results from the worker processes.
</p>
</div>
</div>

<div id="outline-container-org2e85edf" class="outline-3">
<h3 id="org2e85edf">Running epydemic on a default runtime</h3>
<div class="outline-text-3" id="text-org2e85edf">
<p>
I then tried the same experiments on the default Colab set-up.
</p>

<p>
The notebook can import libraries no problem. It can also create
HDF5 notebooks, meaning it has the underlying libraries installed
already. The GUI reports 12GB of RAM and 100GB of disc
(approximately).
</p>

<p>
We run on all the available cores, as reported by the
<code>epyc.ParallelLab.numberOfCores()</code> method. Running the same
experiments as above gives:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-right">vCPUs</th>
<th scope="col" class="org-right">Elapsed time (s)</th>
<th scope="col" class="org-right">Mean/rep (s)</th>
<th scope="col" class="org-right">Variance</th>
</tr></thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">81</td>
<td class="org-right">8.17</td>
<td class="org-right">0.90</td>
</tr>
<tr>
<td class="org-right">2</td>
<td class="org-right">100</td>
<td class="org-right">10.87</td>
<td class="org-right">0.34</td>
</tr>
</tbody>
</table>
<p>
which is a little unusual: there's definitely some overlapped
computation happening, but with large overheads and large variance.
I'm assuming that the number of <i>cores</i> reported is actually the
number of <i>hyperthreads</i>, and that they're interfering because
they're CPU-bound: <code>epyc</code> simply uses the standard Python <code>joblib</code>.
Or it might be that the underlying VM isn't really allocating cores
exclusively. There's really not enough information to decide.
</p>
</div>
</div>
