posts/2022/12/02/jupyter-in-the-cloud.org
** Using specific VM instances

   I signed up for Google Cloud's free trial, 90 days and $300 (£281)
   of credit. Then set up a specific project in which to run the
   experiments, and explored the different VM instance types
   available.

   E2 and N2 are the general-purpose instances, available in
   standard or high-CPU configurations. The E2 is cheaper than the
   N2 but less performant -- although this only cuts in at higher
   loads according to [[https://www.bigbitbus.com/2021/06/10/Google-Cloud-E2-N2-VMs/][this comparison]]. Compute-optimised VMs (C2 and
   C2D) are Intel Xeon or AMD EPYC Milan processors. The C2D has a
   larger last-level cache and so gets recommended for HPC
   workloads.

   The [[https://cloud.google.com/compute/vm-instance-pricing][VM instance pricing]] model charges for a single minute, and
   then after the first minute charges per-second.

   | Instance         | vCPUs | Memory (GB) | On-demand price/hour | Spot price/hour |
   |------------------+-------+-------------+----------------------+-----------------|
   | e2-highcpu-16    |    16 |          16 | $0.395744            | $0.11872        |
   | e2-highcpu-32    |    32 |          32 | $0.791488            | $0.23744        |
   | n2-highcpu-64    |    64 |          64 | $2.294272            | $0.55552        |
   | n2-highcpu-96    |    96 |          96 | $3.441408            | $0.83328        |
   | c2-standard-60   |    60 |         240 | $3.1321              | $0.28428        |
   | c2d-standard-112 |   112 |         448 | $5.0844              | $1.077776       |

   That's quite a range of possible costs.

   The [[https://cloud.google.com/compute/docs/instances/spot][Spot VMs]] are cheaper, but make use of spare capacity and so
   might be pre-empted (or terminated) by higher-priority jobs.
   They're recommended for fault-tolerant workloads, which we could
   possibly get if we extended ~epyc~ with some extra back-end
   functions. You also can't buy them with the free tier's credits.

   There is apparently a limit of 8 vCPUs when using the free tier
   for some instance types in some zones. It's not abundantly clear
   what the restrictions actually are.

   The process to create the custom runtime is to create a Colab VM
   instance from the Marketplace and associate it with an instance
   type of choice, possibly choosing a zone as well. This can then
   be connected to by providing the project, zone, and instance name
   to the Jupyter notebook. (The project name has to be in URL form,
   so lower case with dashes for spaces.) This is awkward and
   requires manual copying, but once done you can acquire a
   connection URL to go straight to the notebook running on that VM.
   The Jupyter UI shows RAM and disc as well as the actual VM
   instance it's connected to, but not the number of cores that
   instance reports, which is a bit annoying.

   There's also an issue in that, when you ask the machine for the
   number of cores it has, it by default replies with the number of
   vCPUs -- which I think means hyperthreads. A 96-vCPU machine (an instance
   ending in "-96") only has 48 cores, because by default 2 vCPUs
   are mapped to each physical core. You can set the ratio of vCPUs
   to cores (1 or 2), and the numnber of visible cores the machine
   reports. So I set a ratio of 1 vCPU/core and reporting the number
   of actual cores, which is the sensible choice for a compute-bound
   application. Unfortunately you can't do this without stopping the
   newly-created Colab VM and re-setting it's configuration: you
   can't do this step at instance creation from the Marketplace. I
   don't know why. (It might be possible to do it in one step from
   the command line. Or create template instances with the right
   configuration.) On the other hand, once it's done, it's
   persistent and can be connected to using the connection URL, as
   the notebook remembers the VM it's connected to.

** Experiments on specific instances

   Running the same experiments as above on different instances gives:

   | Instance      | Cores | Elapsed time (s) | Mean/rep (s) | Variance |
   |---------------+-------+------------------+--------------+----------|
   | e2-highcpu-16 |     1 |               98 |         9.81 |     0.09 |
   |               |     8 |               96 |         9.49 |     0.10 |
   | n2-standard-8 |     1 |               74 |         7.44 |     0.23 |
   |               |     4 |               69 |         6.83 |     0.08 |
   | c2-standard-8 |     1 |               70 |         7.05 |     0.05 |
   |               |     4 |               66 |         6.55 |     0.07 |

   (These are real cores, 1 vCPU/core.)

   There's around a 30% speed difference between the E2 and N2
   silicon, but not much at all between the N2 and C2 -- despite the
   latter being branded for compute-intensive workloads. Might be
   that the C2's cache isn't being exploited?

   We do however get the speed-up we expect from parallelism:
   actually slightly more than we'd expect, since the individual
   runs seem to go faster too. There's definitely some overhead
   incurred in running ~epyc~ in parallel, so we shouldn't see
   super-linear speed-up "in reality".

