2022/12/02/jupyter-in-the-cloud/index.html

<div id="outline-container-org68d40a0" class="outline-3">
<h3 id="org68d40a0">Using specific VM instances</h3>
<div class="outline-text-3" id="text-org68d40a0">
<p>
I signed up for Google Cloud's free trial, 90 days and $300 (£281)
of credit. Then set up a specific project in which to run the
experiments, and explored the different VM instance types
available.
</p>

<p>
E2 and N2 are the general-purpose instances, available in
standard or high-CPU configurations. The E2 is cheaper than the
N2 but less performant – although this only cuts in at higher
loads according to <a href="https://www.bigbitbus.com/2021/06/10/Google-Cloud-E2-N2-VMs/">this comparison</a>. Compute-optimised VMs (C2 and
C2D) are Intel Xeon or AMD EPYC Milan processors. The C2D has a
larger last-level cache and so gets recommended for HPC
workloads.
</p>

<p>
The <a href="https://cloud.google.com/compute/vm-instance-pricing">VM instance pricing</a> model charges for a single minute, and
then after the first minute charges per-second.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
<col class="org-right">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">Instance</th>
<th scope="col" class="org-right">vCPUs</th>
<th scope="col" class="org-right">Memory (GB)</th>
<th scope="col" class="org-left">On-demand price/hour</th>
<th scope="col" class="org-left">Spot price/hour</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">e2-highcpu-16</td>
<td class="org-right">16</td>
<td class="org-right">16</td>
<td class="org-left">$0.395744</td>
<td class="org-left">$0.11872</td>
</tr>
<tr>
<td class="org-left">e2-highcpu-32</td>
<td class="org-right">32</td>
<td class="org-right">32</td>
<td class="org-left">$0.791488</td>
<td class="org-left">$0.23744</td>
</tr>
<tr>
<td class="org-left">n2-highcpu-64</td>
<td class="org-right">64</td>
<td class="org-right">64</td>
<td class="org-left">$2.294272</td>
<td class="org-left">$0.55552</td>
</tr>
<tr>
<td class="org-left">n2-highcpu-96</td>
<td class="org-right">96</td>
<td class="org-right">96</td>
<td class="org-left">$3.441408</td>
<td class="org-left">$0.83328</td>
</tr>
<tr>
<td class="org-left">c2-standard-60</td>
<td class="org-right">60</td>
<td class="org-right">240</td>
<td class="org-left">$3.1321</td>
<td class="org-left">$0.28428</td>
</tr>
<tr>
<td class="org-left">c2d-standard-112</td>
<td class="org-right">112</td>
<td class="org-right">448</td>
<td class="org-left">$5.0844</td>
<td class="org-left">$1.077776</td>
</tr>
</tbody>
</table>
<p>
That's quite a range of possible costs.
</p>

<p>
The <a href="https://cloud.google.com/compute/docs/instances/spot">Spot VMs</a> are cheaper, but make use of spare capacity and so
might be pre-empted (or terminated) by higher-priority jobs.
They're recommended for fault-tolerant workloads, which we could
possibly get if we extended <code>epyc</code> with some extra back-end
functions. You also can't buy them with the free tier's credits.
</p>

<p>
There is apparently a limit of 8 vCPUs when using the free tier
for some instance types in some zones. It's not abundantly clear
what the restrictions actually are.
</p>

<p>
The process to create the custom runtime is to create a Colab VM
instance from the Marketplace and associate it with an instance
type of choice, possibly choosing a zone as well. This can then
be connected to by providing the project, zone, and instance name
to the Jupyter notebook. (The project name has to be in URL form,
so lower case with dashes for spaces.) This is awkward and
requires manual copying, but once done you can acquire a
connection URL to go straight to the notebook running on that VM.
The Jupyter UI shows RAM and disc as well as the actual VM
instance it's connected to, but not the number of cores that
instance reports, which is a bit annoying.
</p>

<p>
There's also an issue in that, when you ask the machine for the
number of cores it has, it by default replies with the number of
vCPUs – which I think means hyperthreads. A 96-vCPU machine (an instance
ending in "-96") only has 48 cores, because by default 2 vCPUs
are mapped to each physical core. You can set the ratio of vCPUs
to cores (1 or 2), and the numnber of visible cores the machine
reports. So I set a ratio of 1 vCPU/core and reporting the number
of actual cores, which is the sensible choice for a compute-bound
application. Unfortunately you can't do this without stopping the
newly-created Colab VM and re-setting it's configuration: you
can't do this step at instance creation from the Marketplace. I
don't know why. (It might be possible to do it in one step from
the command line. Or create template instances with the right
configuration.) On the other hand, once it's done, it's
persistent and can be connected to using the connection URL, as
the notebook remembers the VM it's connected to.
</p>
</div>
</div>

<div id="outline-container-org3222011" class="outline-3">
<h3 id="org3222011">Experiments on specific instances</h3>
<div class="outline-text-3" id="text-org3222011">
<p>
Running the same experiments as above on different instances gives:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">Instance</th>
<th scope="col" class="org-right">Cores</th>
<th scope="col" class="org-right">Elapsed time (s)</th>
<th scope="col" class="org-right">Mean/rep (s)</th>
<th scope="col" class="org-right">Variance</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">e2-highcpu-16</td>
<td class="org-right">1</td>
<td class="org-right">98</td>
<td class="org-right">9.81</td>
<td class="org-right">0.09</td>
</tr>
<tr>
<td class="org-left"> </td>
<td class="org-right">8</td>
<td class="org-right">96</td>
<td class="org-right">9.49</td>
<td class="org-right">0.10</td>
</tr>
<tr>
<td class="org-left">n2-standard-8</td>
<td class="org-right">1</td>
<td class="org-right">74</td>
<td class="org-right">7.44</td>
<td class="org-right">0.23</td>
</tr>
<tr>
<td class="org-left"> </td>
<td class="org-right">4</td>
<td class="org-right">69</td>
<td class="org-right">6.83</td>
<td class="org-right">0.08</td>
</tr>
<tr>
<td class="org-left">c2-standard-8</td>
<td class="org-right">1</td>
<td class="org-right">70</td>
<td class="org-right">7.05</td>
<td class="org-right">0.05</td>
</tr>
<tr>
<td class="org-left"> </td>
<td class="org-right">4</td>
<td class="org-right">66</td>
<td class="org-right">6.55</td>
<td class="org-right">0.07</td>
</tr>
</tbody>
</table>
<p>
(These are real cores, 1 vCPU/core.)
</p>

<p>
There's around a 30% speed difference between the E2 and N2
silicon, but not much at all between the N2 and C2 – despite the
latter being branded for compute-intensive workloads. Might be
that the C2's cache isn't being exploited?
</p>

<p>
We do however get the speed-up we expect from parallelism:
actually slightly more than we'd expect, since the individual
runs seem to go faster too. There's definitely some overhead
incurred in running <code>epyc</code> in parallel, so we shouldn't see
super-linear speed-up "in reality".
</p>
</div>
</div>
